syntax on           " подсветка кода
set number          " номера строк
set tabstop=4       " Ширина табуляции — 4 пробела
set shiftwidth=4    " Ширина отступа при использовании >> или <<
set expandtab       " Превращать табы в пробелы (стандарт для чистого кода)
set smarttab        " Умная работа с табами в начале строки
set cursorline      " Подсветка строки, на которой стоит курсор (легче не терять его)
set showmode        " Всегда показывать, в каком режиме ты (INSERT, VISUAL и т.д.)
set ignorecase      " Игнорировать регистр при поиске
set smartcase       " НО: если ты написал заглавную букву, Vim поймет, что нужен точный поиск
set hlsearch        " Подсвечивать все найденные совпадения
set incsearch       " Прыгать к найденному тексту сразу во время набора
set clipboard=unnamedplus " МАГИЯ: позволяет копировать/вставлять из Vim прямо 
                          " в браузер или Telegram (использует системный буфер)
set mouse=a               " Включает поддержку мыши (можно кликать и скроллить, если лень)
set noswapfile            " Не создавать временные .swp файлы (в 2026 они чаще бесят, чем спасают)



